# Матричный калькулятор, реализующий 15 функций над матрицами:
# 1. Транспонирование матрицы (не назначено)
# 2. Нахождение следа матрицы (не назначено)
# 3. Умножение матрицы на число (не назначено)
# 4. Сложение матриц (не назначено)
# 5. Вычитание матриц (не назначено)
# 6. Генератор матриц(единичная, нулевая, случайная, диагональная, симметричная) (не назначено)
# 7. Экспорт в LaTeX (не назначено)
# 8. Перемножение матриц (не назначено)
# 9. Вычисление определителя (не назначено)
# 10. Решение СЛАУ методом Гаусса (не назначено)
# 11. Нахождение степеней матрицы (не назначено)
# 12. Решение СЛАУ методом Крамера (не назначено)
# 13. Нахождение обратной матрицы (не назначено)
# 14. Решение СЛАУ матричным методом (не назначено)
# 15. LUP разложение матрицы (не назначено)

def exmpl_func(x: int) -> int:
    """Функция-пример, реализующая возведение в квадрат
    и содержащая намеренную ошибку при попытке возведения в квадрат числа 5"""
    if x == 5:
        return 228
    return x**2
